package com.magicmod.mmgeoprovider;

public class CommonNumData {
	private static String TAG = "CommonNumData";

	private static String[][] dataList = null;
	private static String mResult = null;
	private static String mNum = null;

	static {
		if (dataList == null) {
			dataList = new String[][] { { "110", "报警" }, { "112", "电话故障" },
					{ "119", "火警" }, { "120", "医疗急救" }, { "122", "交通报警" },
					{ "114", "号码百事通" }, { "118114", "号码百事通" },
					{ "117", "报时服务" }, { "12121", "天气预报" },
					{ "12580", "中国移动综合信息服务" }, { "160", "信息咨询服务" },
					{ "12319", "城建服务" }, { "12320", "全国公共卫生公益热线" },
					{ "12333", "劳动保障政策咨询" }, { "12348", "法律咨询" },
					{ "12366", "纳税服务" }, { "95598", "供电服务" },
					{ "96100", "民政服务" }, { "10000", "中国电信" },
					{ "10010", "中国联通" }, { "10011", "中国联通充值" },
					{ "10050", "中国铁通" }, { "10060", "中国联通" },
					{ "10070", "中国卫通" }, { "10086", "中国移动" },
					{ "1013088", "中国联通充值" }, { "1013089", "中国联通查费" },
					{ "13800138000", "中国移动充值" }, { "95501", "深圳发展银行" },
					{ "95508", "广东发展银行" }, { "95516", "中国银联" },
					{ "95528", "浦东发展银行" }, { "95533", "建设银行" },
					{ "95555", "招商银行" }, { "95558", "中信银行" },
					{ "95559", "交通银行" }, { "95561", "兴业银行" },
					{ "95566", "中国银行" }, { "95568", "民生银行" },
					{ "95577", "华夏银行" }, { "95580", "邮政储蓄" },
					{ "95588", "工商银行" }, { "95595", "光大银行" },
					{ "95599", "农业银行" }, { "96588", "徽商银行" },
					{ "96198", "农业信用联社" }, { "4008888400", "上海证券交易所" },
					{ "4006789000", "宅急送" }, { "11185", "邮政EMS" },
					{ "4008108000", "DHL快递" }, { "4008111111", "顺丰速运" },
					{ "4008208388", "UPS快递" }, { "4008209868", "TNT快递" },
					{ "4008861888", "联邦快递" }, { "95105366", "中铁快运" },
					{ "4008517517", "麦当劳麦乐送" }, { "4008823823", "肯德基宅急送" },
					{ "4008123123", "必胜客宅急送" }, { "95500", "太平洋保险" },
					{ "95502", "永安财产保险" }, { "95505", "天安保险" },
					{ "95511", "平安人寿" }, { "95512", "平安产险" },
					{ "95515", "合众人寿" }, { "95518", "中国人民保险" },
					{ "95519", "中国人寿保险" }, { "95522", "泰康人寿" },
					{ "95567", "新华人寿" }, { "95569", "安邦财产保险" },
					{ "95585", "中华联合财保" }, { "95590", "大地财产保险" },
					{ "95596", "民生人寿保险" }, { "95105768", "海康人寿" },
					{ "12312", "保护知识产权举报" }, { "12315", "工商举报" },
					{ "12358", "价格举报" }, { "12365", "质量监督" },
					{ "12369", "环保投诉" }, { "96118", "旅游投诉" },
					{ "96178", "廉政投诉" }, { "96310", "城管执法" } };
		}
	}

	public static String getInfo(String num) {
		if (num == null) 
			return null;
		if (num.equals(mNum))
			return mResult;

		mResult = null;
		for (int i = 0; i < dataList.length; i++) {
			if (dataList[i][0].equals(num)) {
				mResult = dataList[i][1];
				break;
			}
		}
		return mResult;

	}

}
